espressif/esp-idf/components/soc/esp32h2/include/soc/pvt_reg.h
/**
 * SPDX-FileCopyrightText: 2022-2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

#ifndef PVT_REG_H
#define PVT_REG_H

#define    PVT_PMUP_BITMAP_HIGH0_REG           (DR_REG_PVT_MONITOR_BASE + 0x0000)
#define    PVT_PUMP_BITMAP_HIGH0               0xffffffff
#define    PVT_PUMP_BITMAP_HIGH0_S             0

#define    PVT_PMUP_BITMAP_HIGH1_REG           (DR_REG_PVT_MONITOR_BASE + 0x0004)
#define    PVT_PUMP_BITMAP_HIGH1               0xffffffff
#define    PVT_PUMP_BITMAP_HIGH1_S             0

#define    PVT_PMUP_BITMAP_HIGH2_REG           (DR_REG_PVT_MONITOR_BASE + 0x0008)
#define    PVT_PUMP_BITMAP_HIGH2               0xffffffff
#define    PVT_PUMP_BITMAP_HIGH2_S             0

#define    PVT_PMUP_BITMAP_HIGH3_REG           (DR_REG_PVT_MONITOR_BASE + 0x000C)
#define    PVT_PUMP_BITMAP_HIGH3               0xffffffff
#define    PVT_PUMP_BITMAP_HIGH3_S             0

#define    PVT_PMUP_BITMAP_HIGH4_REG           (DR_REG_PVT_MONITOR_BASE + 0x0010)
#define    PVT_PUMP_BITMAP_HIGH4               0xffffffff
#define    PVT_PUMP_BITMAP_HIGH4_S             0

#define    PVT_PMUP_BITMAP_LOW0_REG            (DR_REG_PVT_MONITOR_BASE + 0x0014)
#define    PVT_PUMP_BITMAP_LOW0                0xffffffff
#define    PVT_PUMP_BITMAP_LOW0_S              0

#define    PVT_PMUP_BITMAP_LOW1_REG            (DR_REG_PVT_MONITOR_BASE + 0x0018)
#define    PVT_PUMP_BITMAP_LOW1                0xffffffff
#define    PVT_PUMP_BITMAP_LOW1_S              0

#define    PVT_PMUP_BITMAP_LOW2_REG            (DR_REG_PVT_MONITOR_BASE + 0x001C)
#define    PVT_PUMP_BITMAP_LOW2                0xffffffff
#define    PVT_PUMP_BITMAP_LOW2_S              0

#define    PVT_PMUP_BITMAP_LOW3_REG            (DR_REG_PVT_MONITOR_BASE + 0x0020)
#define    PVT_PUMP_BITMAP_LOW3                0xffffffff
#define    PVT_PUMP_BITMAP_LOW3_S              0

#define    PVT_PMUP_BITMAP_LOW4_REG            (DR_REG_PVT_MONITOR_BASE + 0x0024)
#define    PVT_PUMP_BITMAP_LOW4                0xffffffff
#define    PVT_PUMP_BITMAP_LOW4_S              0

#define    PVT_PMUP_DRV_CFG_REG                (DR_REG_PVT_MONITOR_BASE + 0x0028)
#define    PVT_PUMP_DRV0                       0x0000000f
#define    PVT_PUMP_DRV0_S                     27
#define    PVT_PUMP_DRV1                       0x0000000f
#define    PVT_PUMP_DRV1_S                     23
#define    PVT_PUMP_DRV2                       0x0000000f
#define    PVT_PUMP_DRV2_S                     19
#define    PVT_PUMP_DRV3                       0x0000000f
#define    PVT_PUMP_DRV3_S                     15
#define    PVT_PUMP_DRV4                       0x0000000f
#define    PVT_PUMP_DRV4_S                     11
#define    PVT_CLK_EN                          0x00000400
#define    PVT_CLK_EN_S                        10
#define    PVT_PUMP_EN                         0x00000200
#define    PVT_PUMP_EN_S                       9

#define    PVT_PMUP_CHANNEL_CFG_REG            (DR_REG_PVT_MONITOR_BASE + 0x002C)
#define    PVT_PUMP_CHANNEL_CODE0              0x0000001f
#define    PVT_PUMP_CHANNEL_CODE0_S            27
#define    PVT_PUMP_CHANNEL_CODE1              0x0000001f
#define    PVT_PUMP_CHANNEL_CODE1_S            22
#define    PVT_PUMP_CHANNEL_CODE2              0x0000001f
#define    PVT_PUMP_CHANNEL_CODE2_S            17
#define    PVT_PUMP_CHANNEL_CODE3              0x0000001f
#define    PVT_PUMP_CHANNEL_CODE3_S            12
#define    PVT_PUMP_CHANNEL_CODE4              0x0000001f
#define    PVT_PUMP_CHANNEL_CODE4_S            7

#define    PVT_CLK_CFG_REG                     (DR_REG_PVT_MONITOR_BASE + 0x0030)
#define    PVT_CLK_SEL                         0x80000000
#define    PVT_CLK_SEL_S                       31
#define    PVT_MONITOR_CLK_PVT_EN              0x00000100
#define    PVT_MONITOR_CLK_PVT_EN_S            8
#define    PVT_PUMP_CLK_DIV_NUM                0x000000ff
#define    PVT_PUMP_CLK_DIV_NUM_S              0

#define    PVT_DBIAS_CHANNEL_SEL0_REG          (DR_REG_PVT_MONITOR_BASE + 0x0034)
#define    PVT_DBIAS_CHANNEL0_SEL              0x0000007f
#define    PVT_DBIAS_CHANNEL0_SEL_S            25
#define    PVT_DBIAS_CHANNEL1_SEL              0x0000007f
#define    PVT_DBIAS_CHANNEL1_SEL_S            18
#define    PVT_DBIAS_CHANNEL2_SEL              0x0000007f
#define    PVT_DBIAS_CHANNEL2_SEL_S            11
#define    PVT_DBIAS_CHANNEL3_SEL              0x0000007f
#define    PVT_DBIAS_CHANNEL3_SEL_S            4

#define    PVT_DBIAS_CHANNEL_SEL1_REG          (DR_REG_PVT_MONITOR_BASE + 0x0038)
#define    PVT_DBIAS_CHANNEL4_SEL              0x0000007f
#define    PVT_DBIAS_CHANNEL4_SEL_S            25

#define    PVT_DBIAS_CHANNEL0_SEL_REG          (DR_REG_PVT_MONITOR_BASE + 0x003C)
#define    PVT_DBIAS_CHANNEL0_CFG              0x0001ffff
#define    PVT_DBIAS_CHANNEL0_CFG_S            0

#define    PVT_DBIAS_CHANNEL1_SEL_REG          (DR_REG_PVT_MONITOR_BASE + 0x0040)
#define    PVT_DBIAS_CHANNEL1_CFG              0x0001ffff
#define    PVT_DBIAS_CHANNEL1_CFG_S            0

#define    PVT_DBIAS_CHANNEL2_SEL_REG          (DR_REG_PVT_MONITOR_BASE + 0x0044)
#define    PVT_DBIAS_CHANNEL2_CFG              0x0001ffff
#define    PVT_DBIAS_CHANNEL2_CFG_S            0

#define    PVT_DBIAS_CHANNEL3_SEL_REG          (DR_REG_PVT_MONITOR_BASE + 0x0048)
#define    PVT_DBIAS_CHANNEL3_CFG              0x0001ffff
#define    PVT_DBIAS_CHANNEL3_CFG_S            0

#define    PVT_DBIAS_CHANNEL4_SEL_REG          (DR_REG_PVT_MONITOR_BASE + 0x004C)
#define    PVT_DBIAS_CHANNEL4_CFG              0x0001ffff
#define    PVT_DBIAS_CHANNEL4_CFG_S            0

#define    PVT_DBIAS_CMD0_REG                  (DR_REG_PVT_MONITOR_BASE + 0x0050)
#define    PVT_DBIAS_CMD0                      0x0001ffff
#define    PVT_DBIAS_CMD0_S                    0

#define    PVT_DBIAS_CMD1_REG                  (DR_REG_PVT_MONITOR_BASE + 0x0054)
#define    PVT_DBIAS_CMD1                      0x0001ffff
#define    PVT_DBIAS_CMD1_S                    0

#define    PVT_DBIAS_CMD2_REG                  (DR_REG_PVT_MONITOR_BASE + 0x0058)
#define    PVT_DBIAS_CMD2                      0x0001ffff
#define    PVT_DBIAS_CMD2_S                    0

#define    PVT_DBIAS_CMD3_REG                  (DR_REG_PVT_MONITOR_BASE + 0x005C)
#define    PVT_DBIAS_CMD3                      0x0001ffff
#define    PVT_DBIAS_CMD3_S                    0

#define    PVT_DBIAS_CMD4_REG                  (DR_REG_PVT_MONITOR_BASE + 0x0060)
#define    PVT_DBIAS_CMD4                      0x0001ffff
#define    PVT_DBIAS_CMD4_S                    0

#define    PVT_DBIAS_TIMER_REG                 (DR_REG_PVT_MONITOR_BASE + 0x0064)
#define    PVT_TIMER_EN                        0x80000000
#define    PVT_TIMER_EN_S                      31
#define    PVT_TIMER_TARGET                    0x0000ffff
#define    PVT_TIMER_TARGET_S                  15

#define    PVT_COMB_PD_SITE0_UNIT0_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x0068)
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0_S 0

#define    PVT_COMB_PD_SITE0_UNIT1_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x006C)
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1_S 0

#define    PVT_COMB_PD_SITE0_UNIT2_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x0070)
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2_S 0

#define    PVT_COMB_PD_SITE0_UNIT3_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x0074)
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3_S 0

#define    PVT_COMB_PD_SITE0_UNIT0_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x0078)
#define    PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE0_UNIT0_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT0_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT0_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT0_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE0_UNIT0_S 0

#define    PVT_COMB_PD_SITE0_UNIT1_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x007C)
#define    PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE0_UNIT1_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE0_UNIT1_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE0_UNIT1_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE0_UNIT1_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE0_UNIT1_S 0

