espressif/esp-idf/components/soc/esp32h2/include/soc/pvt_reg.h
#define    PVT_COMB_PD_SITE1_UNIT3_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00B4)
#define    PVT_TIMING_ERR_VT1_PD_SITE1_UNIT3   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE1_UNIT3_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE1_UNIT3  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE1_UNIT3_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE1_UNIT3  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE1_UNIT3_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE1_UNIT3 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE1_UNIT3_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE1_UNIT3   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE1_UNIT3_S 0

#define    PVT_COMB_PD_SITE1_UNIT0_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00B8)
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT0   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT0_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT0  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT0_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT0  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT0_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT0 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT0_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT0   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT0_S 0

#define    PVT_COMB_PD_SITE1_UNIT1_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00BC)
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT1   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT1_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT1  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT1_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT1  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT1_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT1 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT1_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT1   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT1_S 0

#define    PVT_COMB_PD_SITE1_UNIT2_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00C0)
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT2   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT2_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT2  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT2_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT2  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT2_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT2 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT2_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT2   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT2_S 0

#define    PVT_COMB_PD_SITE1_UNIT3_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00C4)
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT3   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE1_UNIT3_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT3  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE1_UNIT3_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT3  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE1_UNIT3_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT3 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT3_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT3   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE1_UNIT3_S 0

#define    PVT_COMB_PD_SITE2_UNIT0_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00C8)
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT0   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT0_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT0  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT0_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT0  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT0_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT0 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT0_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT0   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT0_S 0

#define    PVT_COMB_PD_SITE2_UNIT1_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00CC)
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT1   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT1_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT1  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT1_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT1  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT1_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT1 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT1_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT1   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT1_S 0

#define    PVT_COMB_PD_SITE2_UNIT2_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00D0)
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT2   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT2_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT2  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT2_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT2  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT2_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT2 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT2_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT2   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT2_S 0

#define    PVT_COMB_PD_SITE2_UNIT3_VT0_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00D4)
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT3   0x80000000
#define    PVT_TIMING_ERR_VT0_PD_SITE2_UNIT3_S 31
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT3  0x000000ff
#define    PVT_DELAY_NUM_O_VT0_PD_SITE2_UNIT3_S 23
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT3  0x000000ff
#define    PVT_DELAY_LIMIT_VT0_PD_SITE2_UNIT3_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT3 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT3_S 1
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT3   0x00000001
#define    PVT_MONITOR_EN_VT0_PD_SITE2_UNIT3_S 0

#define    PVT_COMB_PD_SITE2_UNIT0_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00D8)
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT0   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT0_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT0  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT0_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT0  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT0_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT0 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT0_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT0   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT0_S 0

#define    PVT_COMB_PD_SITE2_UNIT1_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00DC)
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT1   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT1_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT1  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT1_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT1  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT1_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT1 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT1_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT1   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT1_S 0

#define    PVT_COMB_PD_SITE2_UNIT2_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00E0)
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT2   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT2_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT2  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT2_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT2  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT2_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT2 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT2_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT2   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT2_S 0

