espressif/esp-idf/components/soc/esp32h2/include/soc/pvt_reg.h
#define    PVT_COMB_PD_SITE2_UNIT3_VT1_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00E4)
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT3   0x80000000
#define    PVT_TIMING_ERR_VT1_PD_SITE2_UNIT3_S 31
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT3  0x000000ff
#define    PVT_DELAY_NUM_O_VT1_PD_SITE2_UNIT3_S 23
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT3  0x000000ff
#define    PVT_DELAY_LIMIT_VT1_PD_SITE2_UNIT3_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT3 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT3_S 1
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT3   0x00000001
#define    PVT_MONITOR_EN_VT1_PD_SITE2_UNIT3_S 0

#define    PVT_COMB_PD_SITE2_UNIT0_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00E8)
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT0   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT0_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT0  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT0_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT0  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT0_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT0 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT0_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT0   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT0_S 0

#define    PVT_COMB_PD_SITE2_UNIT1_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00EC)
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT1   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT1_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT1  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT1_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT1  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT1_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT1 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT1_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT1   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT1_S 0

#define    PVT_COMB_PD_SITE2_UNIT2_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00F0)
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT2   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT2_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT2  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT2_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT2  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT2_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT2 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT2_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT2   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT2_S 0

#define    PVT_COMB_PD_SITE2_UNIT3_VT2_CONF1_REG (DR_REG_PVT_MONITOR_BASE + 0x00F4)
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT3   0x80000000
#define    PVT_TIMING_ERR_VT2_PD_SITE2_UNIT3_S 31
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT3  0x000000ff
#define    PVT_DELAY_NUM_O_VT2_PD_SITE2_UNIT3_S 23
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT3  0x000000ff
#define    PVT_DELAY_LIMIT_VT2_PD_SITE2_UNIT3_S 2
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT3 0x00000002
#define    PVT_TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT3_S 1
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT3   0x00000001
#define    PVT_MONITOR_EN_VT2_PD_SITE2_UNIT3_S 0

#define    PVT_COMB_PD_SITE0_UNIT0_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x00F8)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT0_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT0_S 0

#define    PVT_COMB_PD_SITE0_UNIT1_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x00FC)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT1_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT1_S 0

#define    PVT_COMB_PD_SITE0_UNIT2_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0100)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT2_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT2_S 0

#define    PVT_COMB_PD_SITE0_UNIT3_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0104)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT3_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE0_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT3_S 0

#define    PVT_COMB_PD_SITE0_UNIT0_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0108)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT0_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT0_S 0

#define    PVT_COMB_PD_SITE0_UNIT1_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x010C)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT1_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT1_S 0

#define    PVT_COMB_PD_SITE0_UNIT2_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0110)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT2_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT2_S 0

#define    PVT_COMB_PD_SITE0_UNIT3_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0114)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT3_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE0_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT3_S 0

