espressif/esp-idf/components/soc/esp32h2/include/soc/pvt_reg.h
#define    PVT_COMB_PD_SITE0_UNIT0_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0118)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT0_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT0_S 0

#define    PVT_COMB_PD_SITE0_UNIT1_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x011C)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT1_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT1_S 0

#define    PVT_COMB_PD_SITE0_UNIT2_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0120)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT2_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT2_S 0

#define    PVT_COMB_PD_SITE0_UNIT3_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0124)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT3_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE0_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT3_S 0

#define    PVT_COMB_PD_SITE1_UNIT0_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0128)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT0_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT0_S 0

#define    PVT_COMB_PD_SITE1_UNIT1_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x012C)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT1_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT1_S 0

#define    PVT_COMB_PD_SITE1_UNIT2_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0130)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT2_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT2_S 0

#define    PVT_COMB_PD_SITE1_UNIT3_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0134)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT3_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE1_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT3_S 0

#define    PVT_COMB_PD_SITE1_UNIT0_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0138)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT0_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT0_S 0

#define    PVT_COMB_PD_SITE1_UNIT1_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x013C)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT1_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT1_S 0

#define    PVT_COMB_PD_SITE1_UNIT2_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0140)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT2_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT2_S 0

#define    PVT_COMB_PD_SITE1_UNIT3_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0144)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT3_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE1_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT3_S 0

#define    PVT_COMB_PD_SITE1_UNIT0_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0148)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT0_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT0_S 0

#define    PVT_COMB_PD_SITE1_UNIT1_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x014C)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT1_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT1_S 0

#define    PVT_COMB_PD_SITE1_UNIT2_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0150)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT2_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT2_S 0

#define    PVT_COMB_PD_SITE1_UNIT3_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0154)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT3_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE1_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT3_S 0

