espressif/esp-idf/components/soc/esp32h2/include/soc/pvt_reg.h
#define    PVT_COMB_PD_SITE2_UNIT0_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0158)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT0_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT0_S 0

#define    PVT_COMB_PD_SITE2_UNIT1_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x015C)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT1_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT1_S 0

#define    PVT_COMB_PD_SITE2_UNIT2_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0160)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT2_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT2_S 0

#define    PVT_COMB_PD_SITE2_UNIT3_VT0_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0164)
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT3_S 16
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT0_PD_SITE2_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT3_S 0

#define    PVT_COMB_PD_SITE2_UNIT0_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0168)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT0_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT0_S 0

#define    PVT_COMB_PD_SITE2_UNIT1_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x016C)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT1_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT1_S 0

#define    PVT_COMB_PD_SITE2_UNIT2_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0170)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT2_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT2_S 0

#define    PVT_COMB_PD_SITE2_UNIT3_VT1_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0174)
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT3_S 16
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT1_PD_SITE2_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT3_S 0

#define    PVT_COMB_PD_SITE2_UNIT0_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0178)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT0 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT0_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT0    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT0_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT0 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT0_S 0

#define    PVT_COMB_PD_SITE2_UNIT1_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x017C)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT1 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT1_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT1    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT1_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT1 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT1_S 0

#define    PVT_COMB_PD_SITE2_UNIT2_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0180)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT2 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT2_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT2    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT2_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT2 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT2_S 0

#define    PVT_COMB_PD_SITE2_UNIT3_VT2_CONF2_REG (DR_REG_PVT_MONITOR_BASE + 0x0184)
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT3 0x0000ffff
#define    PVT_TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT3_S 16
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT3    0x00008000
#define    PVT_DELAY_OVF_VT2_PD_SITE2_UNIT3_S  15
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT3 0x00000003
#define    PVT_MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT3_S 0

#define    PVT_DATE_REG                        (DR_REG_PVT_MONITOR_BASE + 0xFFC)
#define    PVT_DATE                            0xffffffff
#define    PVT_DATE_S                          0

#endif//PVT_REG_H

#ifdef __cplusplus
}
#endif
